In [0]:
import pandas as pd
import numpy as np

#Introduction to Pandas

###Panda Data Structures , Series & DataFrame
Data structure is the arrangement of data <br>
Series is a sequence of numbers <br>

###Series
pandas provide indexing with the series <br>
s1 is called the Pandas Series object <br>
0-9 is the default index given by the series object <br>

In [0]:
s1 = pd.Series([11,22,33,44,55,66,77,88,99,10])
s1                        #Pandas Series Object

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
9    10
dtype: int64

###accessing value by index
Series object[index]

In [0]:
s1[3]

44

###fancy indexing 
Series object[[list of indexes]]

In [0]:
s1[[1,2,4,7,8]]

1    22
2    33
4    55
7    88
8    99
dtype: int64

###modifying values
Series object[index] = new value

In [0]:
s1[5] = 23          #modifying values in series
s1

0    11
1    22
2    33
3    44
4    55
5    23
6    77
7    88
8    99
9    10
dtype: int64

####modifying multiple values
series object[[list of indexes]] = [new values]

In [0]:
s1[[2,3,4,6]] = [222,333,444,555]
s1

0     11
1     22
2    222
3    333
4    444
5     23
6    555
7     88
8     99
9     10
dtype: int64

###deleting values
del series object[index]

In [0]:
del s1[5]         #deleting a value 
s1

0     11
1     22
2    222
3    333
4    444
6    555
7     88
8     99
9     10
dtype: int64

###inserting values
series object[new index] = value

In [0]:
s1[20] = 33
s1

0      11
1      22
2     222
3     333
4     444
6     555
7      88
8      99
9      10
20     33
dtype: int64

###custom indexs

In [0]:
s2 = pd.Series([1,11,111,111], index = ['oranges', 'apples', 'mangoes', 'watermelons'])
print(s2.index)
print(s2.values)
print(s2)

Index(['oranges', 'apples', 'mangoes', 'watermelons'], dtype='object')
[  1  11 111 111]
oranges          1
apples          11
mangoes        111
watermelons    111
dtype: int64

In [0]:
ourIndex = ['oranges', 'apples', 'mangoes', 'watermelons']
s2 = pd.Series([1,11,111,111], index = ourIndex)
s2

oranges          1
apples          11
mangoes        111
watermelons    111
dtype: int64

###Conditional operators

In [0]:
s2>30

oranges        False
apples         False
mangoes         True
watermelons     True
dtype: bool

In [0]:
s2[s2>30]

mangoes        111
watermelons    111
dtype: int64

In [0]:
s2<30

oranges         True
apples          True
mangoes        False
watermelons    False
dtype: bool

In [0]:
s2[s2<30]

oranges     1
apples     11
dtype: int64

In [0]:
'oranges' in s2

True

In [0]:
'peaches' in s2

False

###creating a series using dictionary

In [0]:
sdata = {'roma' : 1000, "lyma" : 2000, "leej" : 3000, "sera" : 4000}
data = pd.Series(sdata)
data

roma    1000
lyma    2000
leej    3000
sera    4000
dtype: int64

In [0]:
names = ['lyma','leej','sera','roma','susu','baidar']
data1 = pd.Series(sdata, index = names)
data1

lyma      2000.0
leej      3000.0
sera      4000.0
roma      1000.0
susu         NaN
baidar       NaN
dtype: float64

In [0]:
data1['susu'] = 5000
data1

lyma      2000.0
leej      3000.0
sera      4000.0
roma      1000.0
susu      5000.0
baidar       NaN
dtype: float64

###isnull

In [0]:
data1.isnull()

lyma      False
leej      False
sera      False
roma      False
susu      False
baidar     True
dtype: bool

In [0]:
data1.notnull()

lyma       True
leej       True
sera       True
roma       True
susu       True
baidar    False
dtype: bool

##DataFrame
represents a rectangular table of data & contains an ordered collections of columns, each of which can be a different value type (numeric, string, boolean, etc)

In [0]:
data = {'city' : ['toronto','dc','dammam','new york'],
       'year' : [2000, 2001, 2002, 2003],
       'pop' : [1.5, 1.7, 1.9, 2.0]}
df1 = pd.DataFrame(data)
df1

       city  year  pop
0   toronto  2000  1.5
1        dc  2001  1.7
2    dammam  2002  1.9
3  new york  2003  2.0

In [0]:
data1 = {'blood group' : ['O', 'A', 'B', 'A+', 'A-', 'B+','B-'],
        '# of donators': [56, 70, 12, 3, 10, 23, 89],
        '# required' : [67, 89, 12, 2, 5, 78, 12]}
df2 = pd.DataFrame(data1, index = ['one', 'two', 'three', 'four', 'five', 'six', 'seven'])
df2

      blood group  # of donators  # required
one             O             56          67
two             A             70          89
three           B             12          12
four           A+              3           2
five           A-             10           5
six            B+             23          78
seven          B-             89          12

In [0]:
type(df2)

pandas.core.frame.DataFrame

In [0]:
df2.shape

(7, 3)

##DataFrame slicing and indexing

In [0]:
df2['blood group']                                  #selecting single column by column header

one       O
two       A
three     B
four     A+
five     A-
six      B+
seven    B-
Name: blood group, dtype: object

In [0]:
df2[['blood group', '# of donators']]               #selecting multiple columns by column headers

      blood group  # of donators
one             O             56
two             A             70
three           B             12
four           A+              3
five           A-             10
six            B+             23
seven          B-             89

###deleting column

In [0]:
del df2['blood group']
df2

       # of donators  # required
one               56          67
two               70          89
three             12          12
four               3           2
five              10           5
six               23          78
seven             89          12

###inserting column

In [0]:
df2['blood group'] = ['A', 'O', 'B', 'A+', 'A-', 'B+', 'B-']
df2

       # of donators  # required blood group
one               56          67           A
two               70          89           O
three             12          12           B
four               3           2          A+
five              10           5          A-
six               23          78          B+
seven             89          12          B-

In [0]:
df2['litres'] = 100
df2

       # of donators  # required blood group  litres
one               56          67           A     100
two               70          89           O     100
three             12          12           B     100
four               3           2          A+     100
five              10           5          A-     100
six               23          78          B+     100
seven             89          12          B-     100

###modifying column

In [0]:
df2['litres'] = [100,200,300,5,21,43,21]
df2

       # of donators  # required blood group  litres
one               56          67           A     100
two               70          89           O     200
three             12          12           B     300
four               3           2          A+       5
five              10           5          A-      21
six               23          78          B+      43
seven             89          12          B-      21

In [0]:
df2['stock'] = range(7)
df2

       # of donators  # required blood group  litres  stock
one               56          67           A     100      0
two               70          89           O     200      1
three             12          12           B     300      2
four               3           2          A+       5      3
five              10           5          A-      21      4
six               23          78          B+      43      5
seven             89          12          B-      21      6

In [0]:
df2['stock'] = df1['pop']
df2

       # of donators  # required blood group  litres  stock
one               56          67           A     100    NaN
two               70          89           O     200    NaN
three             12          12           B     300    NaN
four               3           2          A+       5    NaN
five              10           5          A-      21    NaN
six               23          78          B+      43    NaN
seven             89          12          B-      21    NaN

In [0]:
data3 = {'Ai' : [79, 98, 98.5, 45, 67, 87, 83, 82, 91, 72],
      'P1' : [80, 78, 79, 56, 45, 35, 25, 89, 89, 43],
      'P3' : [60, 97, 76, 76, 56, 64, 87, 85, 87, 34]}
df3 = pd.DataFrame(data3, index = ['lyma', 'roma', 'leej', 'susu', 'sera', 'baidar', 'isha', 'nemal', 'tooba', 'batoota'])
df3

           Ai  P1  P3
lyma     79.0  80  60
roma     98.0  78  97
leej     98.5  79  76
susu     45.0  56  76
sera     67.0  45  56
baidar   87.0  35  64
isha     83.0  25  87
nemal    82.0  89  85
tooba    91.0  89  87
batoota  72.0  43  34

In [0]:
df3['total marks'] = 300
df3
df3['marksobt'] = df3['Ai'] + df3['P1'] + df3['P3']
df3

           Ai  P1  P3  total marks  marksobt
lyma     79.0  80  60          300     219.0
roma     98.0  78  97          300     273.0
leej     98.5  79  76          300     253.5
susu     45.0  56  76          300     177.0
sera     67.0  45  56          300     168.0
baidar   87.0  35  64          300     186.0
isha     83.0  25  87          300     195.0
nemal    82.0  89  85          300     256.0
tooba    91.0  89  87          300     267.0
batoota  72.0  43  34          300     149.0

In [0]:
df3['status'] = df3['marksobt'] > 200
df3

           Ai  P1  P3  total marks  marksobt  status
lyma     79.0  80  60          300     219.0    True
roma     98.0  78  97          300     273.0    True
leej     98.5  79  76          300     253.5    True
susu     45.0  56  76          300     177.0   False
sera     67.0  45  56          300     168.0   False
baidar   87.0  35  64          300     186.0   False
isha     83.0  25  87          300     195.0   False
nemal    82.0  89  85          300     256.0    True
tooba    91.0  89  87          300     267.0    True
batoota  72.0  43  34          300     149.0   False

In [0]:
df3['status'] = ['Pass' if marks >= 200 else 'Fail' for marks in df3.marksobt]
df3

           Ai  P1  P3  total marks  marksobt status
lyma     79.0  80  60          300     219.0   Pass
roma     98.0  78  97          300     273.0   Pass
leej     98.5  79  76          300     253.5   Pass
susu     45.0  56  76          300     177.0   Fail
sera     67.0  45  56          300     168.0   Fail
baidar   87.0  35  64          300     186.0   Fail
isha     83.0  25  87          300     195.0   Fail
nemal    82.0  89  85          300     256.0   Pass
tooba    91.0  89  87          300     267.0   Pass
batoota  72.0  43  34          300     149.0   Fail

In [0]:
df3['percentage'] = df3['marksobt'] / df3['total marks'] * 100
df3

           Ai  P1  P3  total marks  marksobt status  percentage
lyma     79.0  80  60          300     219.0   Pass   73.000000
roma     98.0  78  97          300     273.0   Pass   91.000000
leej     98.5  79  76          300     253.5   Pass   84.500000
susu     45.0  56  76          300     177.0   Fail   59.000000
sera     67.0  45  56          300     168.0   Fail   56.000000
baidar   87.0  35  64          300     186.0   Fail   62.000000
isha     83.0  25  87          300     195.0   Fail   65.000000
nemal    82.0  89  85          300     256.0   Pass   85.333333
tooba    91.0  89  87          300     267.0   Pass   89.000000
batoota  72.0  43  34          300     149.0   Fail   49.666667

In [0]:
df3['status'] = ['Pass' if Ai > 33 and P1 > 33 and P2 > 33 else 'Fail' for Ai,P1,P2 in zip(df3.Ai, df3['P1'], df3['P3'])]
df3
#df3.Ai is same as df3['Ai'] . cannot be used with spaced names

           Ai  P1  P3  total marks  marksobt status  percentage
lyma     79.0  80  60          300     219.0   Pass   73.000000
roma     98.0  78  97          300     273.0   Pass   91.000000
leej     98.5  79  76          300     253.5   Pass   84.500000
susu     45.0  56  76          300     177.0   Pass   59.000000
sera     67.0  45  56          300     168.0   Pass   56.000000
baidar   87.0  35  64          300     186.0   Pass   62.000000
isha     83.0  25  87          300     195.0   Fail   65.000000
nemal    82.0  89  85          300     256.0   Pass   85.333333
tooba    91.0  89  87          300     267.0   Pass   89.000000
batoota  72.0  43  34          300     149.0   Pass   49.666667

###np.where

In [0]:
df3['status2'] = np.where(((df3.Ai>50) & (df3['P1']>50) & (df3['P3']>50)),"Pass","Fail")
df3

           Ai  P1  P3  total marks  marksobt status  percentage status2
lyma     79.0  80  60          300     219.0   Pass   73.000000    Pass
roma     98.0  78  97          300     273.0   Pass   91.000000    Pass
leej     98.5  79  76          300     253.5   Pass   84.500000    Pass
susu     45.0  56  76          300     177.0   Pass   59.000000    Fail
sera     67.0  45  56          300     168.0   Pass   56.000000    Fail
baidar   87.0  35  64          300     186.0   Pass   62.000000    Fail
isha     83.0  25  87          300     195.0   Fail   65.000000    Fail
nemal    82.0  89  85          300     256.0   Pass   85.333333    Pass
tooba    91.0  89  87          300     267.0   Pass   89.000000    Pass
batoota  72.0  43  34          300     149.0   Pass   49.666667    Fail
abc       1.0   2   3            4       5.0      6    7.000000    Fail

In [0]:
df3.index

Index(['lyma', 'roma', 'leej', 'susu', 'sera', 'baidar', 'isha', 'nemal',
       'tooba', 'batoota'],
      dtype='object')

In [0]:
df3.head()                                     #returns first 5 by default

        Ai  P1  P3  total marks  marksobt status  percentage
lyma  79.0  80  60          300     219.0   Pass        73.0
roma  98.0  78  97          300     273.0   Pass        91.0
leej  98.5  79  76          300     253.5   Pass        84.5
susu  45.0  56  76          300     177.0   Pass        59.0
sera  67.0  45  56          300     168.0   Pass        56.0

In [0]:
df3.head(2)                                    #returns top 2

        Ai  P1  P3  total marks  marksobt status  percentage
lyma  79.0  80  60          300     219.0   Pass        73.0
roma  98.0  78  97          300     273.0   Pass        91.0

In [0]:
df3.tail()                                      #returns bottom 5

           Ai  P1  P3  total marks  marksobt status  percentage
baidar   87.0  35  64          300     186.0   Pass   62.000000
isha     83.0  25  87          300     195.0   Fail   65.000000
nemal    82.0  89  85          300     256.0   Pass   85.333333
tooba    91.0  89  87          300     267.0   Pass   89.000000
batoota  72.0  43  34          300     149.0   Pass   49.666667

In [0]:
df3.tail(3)                                       #retruns bototom 3

           Ai  P1  P3  total marks  marksobt status  percentage
nemal    82.0  89  85          300     256.0   Pass   85.333333
tooba    91.0  89  87          300     267.0   Pass   89.000000
batoota  72.0  43  34          300     149.0   Pass   49.666667

In [0]:
df3.loc['lyma']                                    #retruns all the values of this index

Ai               79
P1               80
P3               60
total marks     300
marksobt        219
status         Pass
percentage       73
Name: lyma, dtype: object

In [0]:
df3.loc['sera']

Ai               67
P1               45
P3               56
total marks     300
marksobt        168
status         Pass
percentage       56
Name: sera, dtype: object

###slicing with loc and iloc
loc includes last index <br>
iloc excludes last index

In [0]:
df3.loc['lyma' : 'susu']                       #returns lyma to susu (includes last index) unlike iloc

        Ai  P1  P3  total marks  marksobt status  percentage
lyma  79.0  80  60          300     219.0   Pass        73.0
roma  98.0  78  97          300     273.0   Pass        91.0
leej  98.5  79  76          300     253.5   Pass        84.5
susu  45.0  56  76          300     177.0   Pass        59.0

In [0]:
df3.iloc[0:3]                                  #i location doesn't include last index like normal indexing (excludes last index)

        Ai  P1  P3  total marks  marksobt status  percentage
lyma  79.0  80  60          300     219.0   Pass        73.0
roma  98.0  78  97          300     273.0   Pass        91.0
leej  98.5  79  76          300     253.5   Pass        84.5

###accessing values

In [0]:
df3.loc['lyma']['percentage']

73.0

In [0]:
df3.iloc[::-1]

           Ai  P1  P3  total marks  marksobt status  percentage
batoota  72.0  43  34          300     149.0   Pass   49.666667
tooba    91.0  89  87          300     267.0   Pass   89.000000
nemal    82.0  89  85          300     256.0   Pass   85.333333
isha     83.0  25  87          300     195.0   Fail   65.000000
baidar   87.0  35  64          300     186.0   Pass   62.000000
sera     67.0  45  56          300     168.0   Pass   56.000000
susu     45.0  56  76          300     177.0   Pass   59.000000
leej     98.5  79  76          300     253.5   Pass   84.500000
roma     98.0  78  97          300     273.0   Pass   91.000000
lyma     79.0  80  60          300     219.0   Pass   73.000000

###inserting a record (row)

In [0]:
df3.loc['abc'] = ['a']
df3

ValueError: ignored

In [0]:
df3.loc['abc'] = [1,2,3,4,5,6,7]
df3

           Ai  P1  P3  total marks  marksobt status  percentage
lyma     79.0  80  60          300     219.0   Pass   73.000000
roma     98.0  78  97          300     273.0   Pass   91.000000
leej     98.5  79  76          300     253.5   Pass   84.500000
susu     45.0  56  76          300     177.0   Pass   59.000000
sera     67.0  45  56          300     168.0   Pass   56.000000
baidar   87.0  35  64          300     186.0   Pass   62.000000
isha     83.0  25  87          300     195.0   Fail   65.000000
nemal    82.0  89  85          300     256.0   Pass   85.333333
tooba    91.0  89  87          300     267.0   Pass   89.000000
batoota  72.0  43  34          300     149.0   Pass   49.666667
abc       1.0   2   3            4       5.0      6    7.000000

#Day 2

In [0]:
data3 = {'Ai' : [79, 98, 98.5, 45, 67, 87, 83, 82, 91, 72],
      'P1' : [80, 78, 79, 56, 45, 35, 25, 89, 89, 43],
      'P3' : [60, 97, 76, 76, 56, 64, 87, 85, 87, 34]}
df4 = pd.DataFrame(data3, columns = ['ai','p1','p3'])
df4

Empty DataFrame
Columns: [ai, p1, p3]
Index: []

In [0]:
data = {'state' : ['Ohio','Ottowa','Toronto','Ohio','Neveda','Missiusaga'],
       'year' : [2000, 2001, 2001, 1990, 1200, 1999],
       'pop' : [1.2, 1.2, 1.7, 1.8, 1.9, 2.2]}
frame = pd.DataFrame(data, columns = ['year','state','pop','extra'], index = ['one','two','three','four','five','six'])
frame
#NaN stands for Not A Number

       year       state  pop extra
one    2000        Ohio  1.2   NaN
two    2001      Ottowa  1.2   NaN
three  2001     Toronto  1.7   NaN
four   1990        Ohio  1.8   NaN
five   1200      Neveda  1.9   NaN
six    1999  Missiusaga  2.2   NaN

### .columns

In [0]:
frame.columns

Index(['year', 'state', 'pop', 'extra'], dtype='object')

### .index

In [0]:
frame.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

### printing single column

In [0]:
frame['year']

one      2000
two      2001
three    2001
four     1990
five     1200
six      1999
Name: year, dtype: int64

In [0]:
frame.year

one      2000
two      2001
three    2001
four     1990
five     1200
six      1999
Name: year, dtype: int64

### printing a single record

In [0]:
frame.loc['one']

year     2000
state    Ohio
pop       1.2
extra     NaN
Name: one, dtype: object

In [0]:
frame

       year       state  pop extra
one    2000        Ohio  1.2   NaN
two    2001      Ottowa  1.2   NaN
three  2001     Toronto  1.7   NaN
four   1990        Ohio  1.8   NaN
five   1200      Neveda  1.9   NaN
six    1999  Missiusaga  2.2   NaN

In [0]:
val = pd.Series([-1.2,-1.3,-1.4], index = ['two','four','five'])
val

two    -1.2
four   -1.3
five   -1.4
dtype: float64

In [0]:
frame.extra = val
frame

       year       state  pop  extra
one    2000        Ohio  1.2    NaN
two    2001      Ottowa  1.2   -1.2
three  2001     Toronto  1.7    NaN
four   1990        Ohio  1.8   -1.3
five   1200      Neveda  1.9   -1.4
six    1999  Missiusaga  2.2    NaN

In [0]:
pop = {'Neveda' : {2000 : 1.3,2002: 1.5},
      'Ohio' : {2000 : 1.2, 1999 : 1.3}}
frame1 = pd.DataFrame(pop)
frame1

      Neveda  Ohio
1999     NaN   1.3
2000     1.3   1.2
2002     1.5   NaN

In [0]:
pd.DataFrame(pop, index = [2000,2002,2003])

      Neveda  Ohio
2000     1.3   1.2
2002     1.5   NaN
2003     NaN   NaN

In [0]:
pdata = {'Ohio' : frame1['Ohio'][:-1],
        'Neveda' : frame1['Neveda'][:2]}
frame2 = pd.DataFrame(pdata) 
frame2

      Ohio  Neveda
1999   1.3     NaN
2000   1.2     1.3

In [0]:
frame2.index.name = 'year'
frame2.columns.name = 'state'
frame2

state  Ohio  Neveda
year
1999    1.3     NaN
2000    1.2     1.3

In [0]:
frame2.values

array([[1.3, nan],
       [1.2, 1.3]])

#5.2 Essential Functionality

##Reindexing series

In [0]:
obj = pd.Series([4.5, 3.2, 4.5, 6.7], index = ['d','b','a','c'])
obj

d    4.5
b    3.2
a    4.5
c    6.7
dtype: float64

In [0]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a    4.5
b    3.2
c    6.7
d    4.5
e    NaN
dtype: float64

In [0]:
obj3 = pd.Series(['yellow','grey','blue'], index = [0,2,3])
obj3

0    yellow
2      grey
3      blue
dtype: object

In [0]:
obj3.reindex(range(6))

0    yellow
1       NaN
2      grey
3      blue
4       NaN
5       NaN
dtype: object

###Forward fill

In [0]:
obj3.reindex(range(6), method = 'ffill')

0    yellow
1    yellow
2      grey
3      blue
4      blue
5      blue
dtype: object

###Backward fill

In [0]:
obj3.reindex(range(6),method = 'bfill')

0    yellow
1      grey
2      grey
3      blue
4       NaN
5       NaN
dtype: object

##Reindexing DataFrames

In [0]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
index = ['a','c','d'], columns = ['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [0]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [0]:
states = ['Texas', 'Utah', 'California']
frame2.reindex(columns = states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [0]:
frame2.reindex(index = ['f','b','a','d','c','g'], columns = ['Texas','NewYork', 'Utah', 'California', 'DC'])

   Texas  NewYork  Utah  California  DC
f    NaN      NaN   NaN         NaN NaN
b    NaN      NaN   NaN         NaN NaN
a    1.0      NaN   NaN         2.0 NaN
d    7.0      NaN   NaN         8.0 NaN
c    4.0      NaN   NaN         5.0 NaN
g    NaN      NaN   NaN         NaN NaN

In [0]:
data = pd.DataFrame(np.arange(1,16).reshape((3,5)), columns = ['a','b','c','d','e'],index = [0,1,2])
data

    a   b   c   d   e
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15

In [0]:
data = pd.DataFrame(np.arange(1,101).reshape((20,5)), columns = list('abcde'), index = range(1,101,5))   
#columns = ['a','b','c','d','e']  is equal to columns = list('abcde')
data

     a   b   c   d    e
1    1   2   3   4    5
6    6   7   8   9   10
11  11  12  13  14   15
16  16  17  18  19   20
21  21  22  23  24   25
26  26  27  28  29   30
31  31  32  33  34   35
36  36  37  38  39   40
41  41  42  43  44   45
46  46  47  48  49   50
51  51  52  53  54   55
56  56  57  58  59   60
61  61  62  63  64   65
66  66  67  68  69   70
71  71  72  73  74   75
76  76  77  78  79   80
81  81  82  83  84   85
86  86  87  88  89   90
91  91  92  93  94   95
96  96  97  98  99  100

In [0]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   6.0    4.0         2.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [0]:
frame2.loc['a':'d':-1]

Empty DataFrame
Columns: [Ohio, Texas, California]
Index: []

In [0]:
frame2.loc[::-1]

   Ohio  Texas  California
d   6.0    7.0         8.0
c   3.0    4.0         5.0
b   6.0    4.0         2.0
a   0.0    1.0         2.0

In [0]:
frame2.loc[::-1,'Texas'::]

   Texas  California
d    7.0         8.0
c    4.0         5.0
b    4.0         2.0
a    1.0         2.0

In [0]:
print(frame2.loc['c']['California'])
print(frame2.loc['c'][2])

5.0
5.0

In [0]:
frame2.loc[::-1,::-1]

   California  Texas  Ohio
d         8.0    7.0   6.0
c         5.0    4.0   3.0
b         NaN    NaN   NaN
a         2.0    1.0   0.0

In [0]:
frame2.iloc[::-1,::-1]

   California  Texas  Ohio
d         8.0    7.0   6.0
c         5.0    4.0   3.0
b         NaN    NaN   NaN
a         2.0    1.0   0.0

In [0]:
frame2.loc['a':'c']

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0

In [0]:
frame2.iloc[0:2]

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN

In [0]:
frame2.loc['b'][0] = 2
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   2.0    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [0]:
frame2.loc['b'][1:] = [4,6]
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   2.0    4.0         6.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [0]:
frame2.loc['b'][[2,0]] = frame2.loc['b'][[0,2]]
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   2.0    4.0         6.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0

NameError: ignored

In [0]:
frame2['Texas'][1] + 5

9.0

nan + any number = nan <br>
nan + nan = nan <br>
nan - any number = nan <br>

In [0]:
abs(-4)

4

In [0]:
abs(4)

4

###Checking nan

In [0]:
frame2.isna()

    Ohio  Texas  California
a  False  False       False
b  False  False       False
c  False  False       False
d  False  False       False

In [0]:
frame2[frame2>3]

   Ohio  Texas  California
a   NaN    NaN         NaN
b   NaN    4.0         6.0
c   NaN    4.0         5.0
d   6.0    7.0         8.0

In [0]:
frame2.isnull()

    Ohio  Texas  California
a  False  False       False
b  False  False       False
c  False  False       False
d  False  False       False

##fillna fills Nan with a specific number <br>
frame.fillna(num, inplace = True) <br>
inplace removes Nan and replaces the num in orignal <br>
without inplace Nan is replaced only in runtime not in orignal <br> 
###dropna drops the column

In [0]:
frame2.fillna(2)

   Ohio  Texas  California
a   0.0    1.0         2.0
b   2.0    4.0         6.0
c   3.0    4.0         5.0
d   6.0    7.0         8.0